// /*-------------------------------------------------------------------------------------/
// | Iterates the list ’lst’ and applies the function ’f’ to the content of each element. |
// /*------------------------------------------------------------------------------------*/

// /*----------------------------------------------------------/
// | リスト「lst」をループし、関数「f」を各要素のコンテンツに適用します。 |
// /*---------------------------------------------------------*/

//引数1 :要素へのポインタのアドレス。
//引数2 :リストのループ時に適用される関数のアドレス。
//返り値 : 無し
//使用関数 : 無し

// #include "libft.h"
#include <stdlib.h>
#include <unistd.h>
#include "libft.h"
#include <string.h>

void ft_lstiter(t_list *lst, void (*f)(t_list *))
{

  while (lst != NULL)
  {
    f(lst->content);
    lst = lst->next;
  }
}
