// /*--------------------------------------------------------------------------------------------------------------------------------------------------/
// | Takes as a parameter an element and frees the memory of the element’s content using the function ’del’ given as a parameter and free the element. |
// | The memory of ’next’ must not be freed.                                                                                                           |
/*-------------------------------------------------------------------------------------------------------------------------------------------------*/

// /*----------------------------------------------------------------------------------------------------/
// | 引数として要素を受け取り、引数として指定された関数「del」を使用して要素のコンテンツのメモリを解放し、要素を解放します。 |
// | 「next」のメモリを解放してはいけない。                                                                    |
// /*---------------------------------------------------------------------------------------------------*/

//引数1 : 開放する要素
//引数2 : 要素のcontentを削除するために使用される関数のアドレス。
//返り値 : 無し
//使用関数 : free

#include "libft.h"

void ft_lstdelone(t_list *lst, void (*del)(void *))
{
  if (!lst || !del)
    return;

  del(lst->content);

  free(lst);
}
